[["23.05.2018 15:27:47","Владислав","Добрый день,нужно сделать как у вас на странице  Озвучивание текста на сайте  по выделению помогите пожалуйста своих мозгов не хватает","http:\/\/e08471vy.bget.ru","borodinvi@cspu.ru","77.222.115.219","Здравствуйте, Владислав![br]А что именно из перечисленных выше инструкций вызвало затруднение? Опишите проблему подробнее, чтобы я смог помочь.","WP"],["22.06.2018 15:15:36","Андрей","Ничего не могу понять.[br]Добавил скрипт API в тег head. Добавил скрипт настройки с указанием ключа + кнопку. Указал id блока, который нужно воспроизводить. Но не работает. [br]Какие манипуляции нужно еще выполнить, что бы синтез текста заработал?","","avj.andee@gmail.com","37.26.234.14","Здравствуйте, Андрей![br][b]Джумла[\/b] - это отдельный разговор. Как Вы добавляете скрипт? Родной редактор скрипты режет. Я пользовался плагином Flexi Custom Code для добавления своих скриптов. Но, поскольку я не часто сталкиваюсь с этой CMS, возможно, в ней уже появились встроенные инструменты для этого.[br]В любом случае - нужно посмотреть сайт через веб-консоль, что там происходит.","Joomla"],["23.06.2018 12:19:25","Андрей","Я не интегрирую в Joomla.[br]Установку скрипта я произвожу в шаблон, который установлен на Joomla. Но скрипт не срабатывает. [br]А вот по какой причине - понять не могу. Видимо не добавлен какой-то элемент...","cit.tsn.lokos.net","avj.andee@gmail.com","5.18.239.194","Консоль чётко пишет по этому поводу: [br][i]ReferenceError: tts is not defined[\/i][br]Что означает, что переменная tts не определена, а обращение к ней идёт.[br]===[br]Попробуйте заменить код примера на:[br]      onload= function() {[br]        this.tts = new ya.speechkit.Tts([br]        \/\/ Настройки синтеза речи.[br]        {[br]        \/\/ API-ключ. Обязательно!!![br]        apikey: '<key>',[br]        \/\/== Необязательные настройки[br]        \/\/ Эмоциональная окраска: добрый голос.[br]        emotion: 'good',[br]        \/\/ Скорость речи.[br]        speed: 1.5,[br]        \/\/ Имя диктора.[br]        speaker: 'jane'  [br]      });[br]      }","Joomla"],["23.06.2018 17:37:02","Андрей","Большое спасибо. Данный вариант сработал.[br]Правда, не без вопросов. Сейчас скрипт запускает озвучивание всего текста на странице, не зависимо от того, к какому объекту применен id. И самое печальное, он долго срабатывает. Озвучка текста начинается через 1 минуту, если не больше.[br]Подскажите, представленный пример должен озвучивать выделенный текст или он воспроизводит весь текст на странице? Если второе, то что необходимо для того, что бы воспроизводился только тот текст, который выделен?","cit.tsn.lokos.net","avj.andee@gmail.com","5.18.239.194","Здравствуйте, Андрей![br]Данный скрипт озвучивает весь текстовый контент, присутствующий в DOM-элементе [i]document.getElementById('forSpeach' )[\/i]. В моём примере - это стихотворение Фета.[br]Вы можете создать любой блочный элемент с id=forSpeach и разместить в нём необходимый для озвучки текст (см. п.4 инструкции выше). Сейчас у Вас в блоке c этим идентификатором находится весь контент страницы. Отсюда и время отправки \/ приёма данных серверу Яндекса.[br]===[br]ЗЫ. Изменил код на странице. Действительно, вовсе не обязательно вешать скрипт в обработчик события загрузки страницы, когда отправка на озвучивание происходит по клику пользователя.[br]ЗЗЫ. Домен 4 уровня! Это круто =)","Joomla"],["30.07.2018 12:45:48","Рафаэль","Сделал как в вашем примере но выдает ошибку:[br]TypeError: namespace.ya.speechkit.settings is undefined[br]в head я подключаю скрипт и создаю tts как в вашем примере[br]даже без запуска речи выдает эту ошибку[br]и в другом варианте тоже ошибка:[br]в head я подключаю скрипт[br]в window.onload я создаю tts[br]и сразу после этого запускаю tts.speak()[br]ошибка: [br]Session null: Error:","","neyaru@ya.ru","5.140.73.136","",""],["30.07.2018 12:50:21","Рафаэль","может быть у меня браузер устаревший (фаерфокс 48 на маке)","","neyaru@ya.ru","5.140.73.136","",""],["30.07.2018 15:19:30","Рафаэль","нашел причину - почему то ключ который я получил на яндексе не работает - попробовал чужой ключ из примера и заработало","","neyaru@ya.ru","5.140.73.136","Здравствуйте, Рафаэль![br]Только что прочёл Ваши посты. Отлично, что нашли причину.[br]Броузер, в любом случае, был бы не при чём, если бы на моём сайте пример арботал, а на Вашем - тот же код - нет.[br]Спасибо, что указали причину, может быть полезно другим.",""],["31.07.2018 06:07:22","Павел","Статья актуальная, работает?","","marozov@icloud.com","185.229.67.56","К сожалению, уже нет. Яндекс изменил условия использования сервиса, и теперь бесплатный ключ можно получить только на месяц.",""]]