<?php
require(\H::$Dir  . 'assets/calc.php');
?>

<script src="/<?=\H::$Dir ?>assets/calc.js"></script>

<h2>Описание</h2>
<div id="opis">
	<p>Этот калькулятор был написан по причине необходимости быстрого расчета простых арифметических выражений в любой момент времени. Сначала я попытался поискать такой в инете, но найденные мной работали только при манипуляции с мышью, чем значительно увеличивали время на ввод данных. В задачу своего калькулятора я поставил возможность максимального использования NumLock клавиатуры для удобства пользования. И вот, что получилось.</p>
</div>

<h3 class="zagl">Справочное руководство по использованию калькулятора</h3>

<p>Работать с этим калькулятором чрезвычайно просто. Достаточно ввести с клавиатуры любую последовательность арифметических операций и нажать "Enter", в основном поле появится результат, с которым можно продолжать работу. Кнопки "М+" и "М-" соответственно добавляют и вычитают значение основного поля в стек памяти. Кнопка "MR" возвращает значение памяти в основное поле. Причем, можно использоватьь его в уже происходящей операции. Например, у вас в основном поле уже набрано "123+25*2+", вы нажимаете клавишу "MR" (либо делаете двойной клик по значению стека памяти), и значение стека памяти становится в конец выражения. После нажатия "Enter" появится результат "296". Не запутаться с сохраненными результатами вам поможет окошко, отображающее текущее состояние стека памяти, и расположенное под основным полем.</p>
<p>Теперь калькулятор сохраняет значения стеков памяти! То есть, если вы сохранили в нем какие-то значения - уже не нужно бояться перезагружать страницу или даже закрыть броузер. После его открытия все сохраненные результаты будут вновь воспроизведены в стеках памяти.</p>
<p>Работа со степенями тоже максимально упрощена. Введите в основное поле основание, а в поле степени, отмеченное значком "^" - степень и нажмите "Enter". Результат сразу же отобразится в основном поле. Таким же образом можно извлекать корни, вводя в окошко степени дробные значения. Например, квадратному корню соответствует степень "1/2", а кубическому - "1/3". Можно вводить как целые числа, так и простые и десятичные дроби. При работе со степенями, можно пользоваться и отрицательными значениями степеней. Напомню, что отрицательная степень эквивалентна степени обратного основания. То есть, 10<sup>-3</sup>=1/10<sup>3</sup>.</p>
<p>Добавлена возможность выбора точности вывода результата. В выпадающем окошке под основным полем теперь можно выбрать количество десятичных знаков после запятой, до которых будет округляться полученное значение. Назначить точность результата необходимо до момента окончания ввода данных для расчета. По умолчанию стоит точность до двух знаков после запятой, какая и была в калькуляторе изначально.</p>
<p>Cоздано выпадающее меню, позволяющее вызывать панели с дополнительными функциями. Уже реализованы панели "Тригонометрия" и "Арматура".</p>
<p>В панели <strong>"Тригонометрия"</strong> присутствуют такие функции как синус, косинус, тангенс, котангенс, арксинус, арккосинус, арктангенс и арккотангенс. Для того, чтобы получить синус угла, надо ввести его значение в градусах (можно с десятичными знаками) в основное поле и нажать кнопку соответствующей функции. Результат отобразится в основном поле.</p>
<p>Панель <strong>"Арматура"</strong> позволит за пару секунд вычислить массу и площадь круглых или квадратных стержней любого диаметра. Возможен учет количества и длины арматурных стержней. Для получения результата достаточно ввести необходимые данные в соответствующие ячейки, результат будет отображаться по мере ввода.</p>
<p>Работу калькулятора можно посмотреть, кликнув на кнопку в левом верхнем углу экрана.</p>