[["15.10.2014 00:31:36","Kirill","Спасибо большое!<br \/>Скажите, а как можно изменить ширину поля выбора версии? Или она фиксированная?","http:\/\/koni-kirovsk.ru","kirill@koni-kirovsk.ru","95.54.215.141","Здравствуйте. Это элементарно можно сделать стилями.","",""],["06.11.2014 12:16:42","Igor","Добрый день! Утром поставил Ваш скрипт для  слабовидящих - все отлично работало! А сейчас при выборе из меню ВЕРСИЯ ДЛЯ СЛАБОВИДЯЩИХ ничего не происходит. Может, из-за того, что сайт юкозовский или какая-то другая причина имеется? А, вообще, спасибо большое - первый бесплатный скрипт более-менее соответствующий стандарту. Для образовательных учреждений крайне актуально - прокуратура свирепствует  :)","http:\/\/sportkovdor.ucoz.ru\/?lQIOAu\/","","178.65.204.110","Здравствуйте! Извините, временные технические неполадки. Напишите свою почту, чтобы я мог ответить, что нужно будет изменить после апгрейда скрипта.<br \/>===================<br \/>Уже должно быть все в порядке. Нажмите F5.","",""],["06.11.2014 19:49:57","Igor","Да, все работает! Спасибо!","http:\/\/sportkovdor.ucoz.ru\/","ringvar@yandex.ru","178.65.204.110","","",""],["19.11.2014 15:01:43","Igor","Добрый день! Сегодня обнаружил проблему- скрипт не дает при загрузке файлов, статей или фотографий выбирать категорию (интерфейс выбора такой же). Ставил скрипт  и верхнюю часть сайта , и нижнюю - бесполезно. Удалил.<br \/>А я уж думал, мне повезло :a <br \/>Может быть, как-то можно оптимизировать скрипт на юкозовском сайте?","http:\/\/sportkovdor.ucoz.ru\/","ringvar@yandex.ru","95.54.251.222","1. Не совсем понял проблему. Где я ее могу увидеть?<br \/>2. Место установки скрипта значения не имеет. Есть определенные правила, но вряд ли вы их нарушили.<br \/>3. Посмотрите этот вариант, он, правда платный, но стоит символически.<br \/>http:\/\/kpa-ing.ru\/Javascripts\/%D0%92%D0%B5%D1%80%D1%81%D0%B8%D1%8F%20%D1%81%D0%B0%D0%B9%D1%82%D0%B0%20%D0%B4%D0%BB%D1%8F%20%D1%81%D0%BB%D0%B0%D0%B1%D0%BE%D0%B2%D0%B8%D0%B4%D1%8F%D1%89%D0%B8%D1%85%20PRO.htm","",""],["19.11.2014 17:05:25","Igor","Вина не данного скрипта. Удалил, но проблема осталась. Буду искать... Павел, извини!","http:\/\/sportkovdor.ucoz.ru\/","","178.65.251.154","Да ничего, программиста обидеть каждый может! =)<br \/>На самом деле, это вина криворуких Юкозовских \"специалистов\", создающих жуткие конфликтные скриптовые конструкции, и не заботящихся о проверке наследуемых свойств от прототипа объекта в циклах for...in. Но мне удалось пока их обойти. Если они вновь не придумают еще чего-то подобного, то все будет работать и далее.","",""],["03.11.2017 21:43:31","любовь","не работает скрипт","http:\/\/десподзиновская-школа.рф","kisler1981@mail.ru","31.173.243.24","Здравствуйте, Любовь![br]Возможно, есть конфликт с установленными у Вас скриптами. Чтобы сказать точнее, нужно видеть страницу с установленным скриптом.[br][b]UPD - 03.12.2017[\/b][br]Сегодня переписал скрипты на нативный код, что должно устранить все возможные конфликты. Попробуйте заменить вставленный ранее код на выложенный на этой странице сейчас.","Другая"],["22.11.2017 02:37:24","shyngys","Добрый день! вы в javascript коде отключаете fancybox?  как можно решить эту проблему посоветуйте","mirbuketov.kz","shyngys.abdaly@gmail.com","85.117.97.131","Здравствуйте, Чингиз![br]Возможно, есть конфликт. Попробую посмотреть у вас в сайте, если нужна будет дополнительная информация, отпишусь в указанную почту.[br][b]UPD - 03.12.2017[\/b][br]Писал Вам на email, что не могу попасть на Ваш сайт, но Вы так и не ответили.[br]Сегодня переписал скрипты на нативный код, что должно устранить все возможные конфликты. Попробуйте заменить вставленный ранее код на выложенный на этой странице сейчас.","Другая"],["23.09.2018 12:41:58","Александр","Добрый день! Спасибо за скрипт, но почему то не работает[br]Страница school12-geldor.ru[br]Все встроил, просписал размер в заголовке, но при нажатии на сайте ничего не меняется. Поможете?[br]Спасибо!","school12-geldor.ru","yarilax@yandex.ru","89.169.18.181","Здравствуйте, Александр![br]На здоровье. Скрипт полностью рабочий, посмотрю, в чём у вас конкретно проблема, отвечу на указанный email.[br]Уже разобрался. У вас нет файла стилей по пути - http:\/\/school12-geldor.ru\/css\/Slabovid_uni.css","Parallels"],["22.12.2018 14:02:30","Александр","Павел, здравствуйте! Так и не понял, как к Вам добавить инструкции, просто пишу в комментарии, а Вы уж там разместите куда нужно, ок?\nЗначит для конструктора Parallels особенности следующие: помещаем slabovid_uni.css в корень папки CSS без \/assets. Ее там просто нет. Скрипты работают прекрасно, причем оба. Немножко подредактировал положение и шрифт. Смотрим здесь school12-geldor.ru","\/\/school12-geldor.ru","yarilax@yandex.ru","89.169.109.143","Здравствуйте, Александр!\nВы всё сделали верно в Вашем случае. Как проверку можно использовать открытие файла стилей по пути, прописанном в скрипте - прямо в новой вкладке броузера.\nЕсли при открытии пути к стилям виден код CSS - значит, всё сделано верно. Если возвращается 404 ошибка - значит нужно либо переместить файлы скрипта, либо редактировать пути к ним с соответствии с реальным расположением файлов.",""],["09.01.2019 14:34:43","Антон","Добрый день, недавно перестала работать версия для слабовидящих  :( ,можете подсказать в чем дело? сайт http:\/\/www.tipk.ru","http:\/\/www.tipk.ru","Angrymangust@gmail.com","81.28.169.220","Здравствуйте, Антон!\nНасколько я вижу, скрипт на сайте http:\/\/www.tipk.ru работает.\nВ каком броузере вы смотрите?",""],["2020-07-03 21:02:49","Ольга","Подскажите, а есть ли решение для тильды? Файл со стилями туда загрузить нельзя, попробовала на сторонний сервер, ссылку вставила полную. Страница обновляется, но толку никакого.","","bindasovaolga74@mail.ru","2.93.192.138","Здравствуйте, Ольга!\n\nЯ не помню, были ли у меня заказы с Тильды, дайте доступ к сайту, могу посмотреть. В принципе, мои скрипты работают абсолютно на любой платформе, где есть возможность использовать пользовательский яваскрипт. На Юкозе было много заказов, все отлично работают.",""],["2020-07-04 21:47:12","Ольга","http:\/\/project2558954.tilda.ws\/  это пока проект,который в работе.  Вот при клике на кнопку страница обновляется, но ничего не происходит. Вероятно, что на тильду нельзя загрузить стили в файле, просто кодом скрип и стили можно, но у вас в кнопке идет отсылка именно к файлу со скриптами. поэтому с тильдой проблема.\n\nПардон, не к файлу со скриптами, а со стилями.","http:\/\/project2558954.tilda.ws\/","bindasovaolga74@mail.ru","2.93.192.138","Нет, Ольга. У Вас не верно прописан путь к файлу со стилями. В Вашем случае стоит:\ndizSave('https:\/\/cp-hosting.jino.ru\/management\/filemanager\/edit\/domains\/redpanda-art.info\/Slabovid_uni.css');\nНо при этом по пути https:\/\/cp-hosting.jino.ru\/management\/filemanager\/edit\/domains\/redpanda-art.info\/Slabovid_uni.css никакого файла нет. Поэтому скрипт пытается подгрузить несуществующий файл и, соответственно, не работает.","Tilda"],["2020-07-05 09:17:39","Ольга","Спасибо больше! Переставила путь напрямую из домена, тогда заработало.","http:\/\/project2558954.tilda.ws\/","bindasovaolga74@mail.ru","2.93.192.138","На здоровье! Теперь всё сделано верно.","Tilda"]]