["Тараканы могут выжить при ядерной войне, а от удара газетой выжить не могут. Это ещё раз доказывает, насколько опасны современные бумажные СМИ.","Ауешники и представители криминальных субкультур чётко разграничивают, с кем можно принимать пищу за одним столом, а с кем нет, это разграничение характерно для любой кастовой системы.Толерантные европейцы чужды этому разделению, а взаимодействие представителей этих культур иногда приводит к… читать дальше >","Приятель, ещё до переезда в столицу, очень долго и упорно искал себе жену. Девушки ему нравились целостные, состоявшиеся по жизни, а главное - сочетающие в себе формат \"коня на скаку остановит\" и нежную заботу о домашнем очаге. Сам он много чего добился, спортивен, красив - посему как говорится,… читать дальше >","В прошлом году прямо перед новым годом я встречался с одним из инвесторов. По пути до офиса зашли в салон мобильной связи одного из операторов \"большой тройки\".  В салоне очередь, но вопрос у меня был весьма срочный, поэтому встали в неё, продолжая на \"птичьем языке\" обсуждать дела. В пол уха слышу,… читать дальше >","- Простите, Вы не видели моего брата-близнеца?- Так вы уже спрашивали.","- Давай поиграем в сексуальные игры- Давай. - Ты доктор – я больной.- Ладно.- Здравствуйте доктор. У меня целый день стояк. Помогите!- Я – платный доктор.","Соседка рассказывает:\"На днях чуть в потусторонний мир не поверила.В среду вечером принесла маленькую искусственную ёлку, украсила дождиком и игрушками и поставила её в угол.В четверг прихожу после работы домой - а ёлка стоит посередине комнаты! Ну, думаю, это я утром в спешке её передвинула и… читать дальше >","На днях к моему провайдеру явилась проверка из Госстандарта с веским вопросом: - С какой погрешностью вы измеряете мегабайт? Многочасовые попытки объяснить, что мегабайт - это конкретная величина, что её не измеряют, а считают, в конце концов, послать проверку в... Палату мер и весов за эталонным мегабайтом ни к чему не привели. Проверка составила акт и удалилась со словами: - У вашего конкурента есть сертифицированная нами методика измерения мегабайта с погрешностью не превышающей 10%. Рекомендуем купить, иначе будете лишены лицензии...","Прыгать с парашютом совсем не страшно.Открываешь дверь самолёта - а там Google Maps.Вы ведь не боитесь Google Maps?","У ласковой женщины нет недостатков.","Нужно начать называть года жизни «уровнями», потому что фраза «Я на 43-м уровне» звучит намного круче, чем осознание, что ты уже старый пердун.","Друзья в том году решили уединиться компанией на Рождественские праздники в глубинке Финляндии. В общем купили уединенный котедж на севере страны - чуть ли не на острове какого-то озера. Ближайший населенный пункт, где можно было запастись провизией около часа пиликания на авто. На второй день… читать дальше >","Неверие в Деда Мороза — это детский атеизм.","Хочется рассказать историю двухгодичной давности, которая в этом декабре неожиданно увенчалась счастливым концом. Настолько неожиданным, что я прямо подарком себе к НГ и Рождеству этот финал восприняла...Живём в деревенском доме в Подмосковье. Через дом за эти 15 лет прошло много животных, собак и… читать дальше >","В фильмах ужасов для снеговиков показывают, как люди едят мороженое и делают морковь по корейски.","- Кошелёк или секс, быстро! Считаю до трёх! - Женщина, ну нет у меня при себе денег, убивайте...","Это тяжёлая работа - отдыхать по-русски.","Политкорректность требует недалёких людей называть параинтеллектуалами.","Бизнес:Джинсы стоят 1500 рублей;рваные джинсы стоят 3500 рублей.Порву ваши джинсы всего за 500 рублей.","Сталкивайтесь лобками, а не лбами!","Максим Галкин, критикуя власть, решил взять не только фамилию жены, но и новое имя - Емельян!","Говорящее зеркало бывает двух видов - лживое и разбитое.","- Кто является родоначальником марксизма-ленинизма?  - Это бюстгальтер! Объединяет левое и правое, поддерживает слабых, привлекает широкие народные массы.","- На новогоднем корпоративе можно сделать множество вещей, за которые потом будет стыдно и лишь одну, за которую потом будет обидно.- Какую же?- Проснуться утром 1 января на рабочем месте.","- Знаешь, какая главная национальная идея у нашего истеблишмента?- Тырить всё, что не приколочено.- Нет, главная национальная идея у них…- Вышестоящую жопу вылизывать.- А вот и нет. Главная идея у них…- Угадывать желания начальства.- Да нет же. Главное для них - не высовываться и ни в коем случае не портить настроение сами знаете кому.- Почему?- А чтоб не мешал тырить всё, что не приколочено.","- Сынок, ты слышал, у наших соседей ребенок родился?- Ну, какая это новость, папа! При наших тонких стенах, я мог тебе это еще 9 месяцев назад предсказать!","Как и живую изгородь, амбиции следует регулярно постригать. Чтобы слишком выросшие амбиции не заслонили реальность.","Плохо, когда в жизни мало юмора, еще хуже, когда в ней много сатиры.","у многих дяди честных правилмой подготовил всем сюрпризна новый год купил отравыдля крыс","Страшный сон Александра Лукашенко – жители Белоруссии смотрят новогоднее обращение президента, стоящего на фоне Кремля©","Папуасья спесь.Намедни прочел тут историю о страданиях одного дурня, что в присутствии пашпорт получая, нужной кнопочки не нашел.А спросить не сдюжил, ибо язык забыл.И «Муму» ему, сердяге, вручили, когда он жалобную книгу клянчил.Но позабавило не это. А живейшее участие в обсуждалке эмигрантов… читать дальше >","Лентяй - человек, которому лень выговаривать слово \"прокрастинация\"."]