["Мы построили первый в мире космодром, на котором посадки начались раньше чем старты.","В лифте Госдумы кто-то нацарапал неприличное слово \"совесть\".","Хорошо, что Путин много ездит по стране и посещает разные предприятия.Плохо, что на этих предприятиях он встречается с одними и теми же работниками ФСО.","Я тут уже как-то рассказывал историю, как три раза прямо перед моим носом пытались кинуть пачку денег (долларов), чтобы я ее поднял, и т.п. (ну, стандартное мошенничество 90-х и начала 2000-х). При этом я тогда еще не представлял (в первый раз), что это мошенничество, но - моя природная честность… читать дальше >","Про ёлки. Истории уже сто лет, или около того. Прадед мой в глухой деревеньке служил ветеринаром, и вокруг ветлечебницы высадил десяток ёлок. Когда елочки хорошо подросли, возникла опасность, что под Новый год односельчанам будет лень топать до леса. Вот в горячую пору и появилась у прадеда привычка… читать дальше >","В изучении английского есть момент, когда индусов уже  понимаешь, а англичан еще нет.","Заказал себе даму лёгкого поведения. Так получилось, что вместе с ней в лифте поднялась моя мама. Ещё никто за 5000 рублей не смотрел мои детские фотографии.","К вопросу о маркетинге.Сегодня взял заказ прикурить автомобиль. Обычная стоимость 1500 рублей. Диспетчер мне в заказе пишет 1500 и голосовым сообщением подтверждает \"С клиента взять 1500\". Прикурил, девушка отдает 1400. Я ей - с Вас 1500. Она - почему? У Вас на сайте 1400 и диспетчер мне… читать дальше >","Почему Творец не создал жизнь ещё до большого взрыва? Да как-то времени не было.","- Жена сказала, что я провожу мало времени с ребенком, а потом показала на какого-то мелкого пацана у нас в доме.","Группу \"На-На\" не пустили с гастролями по Украине, потребовав сменить название на \"В-В\".","- Роза, а шо ваша Циля, всё ждёт принца на белом Бентли?- Софа, та я вас умоляю! Лишь бы был хороший человек. И какая разница, какого цвета у него Бентли.","Что является самым коварным и опасным врагом современного искусства? Пожар? Сырость? Перепад температур? Финансовый кризис? Маньяк с ножом? Время?Нет! Самым опасным и коварным врагом современного искусства является уборщица.1. В ноябре 2011 года, в музее Дортмунда уборщица уничтожила… читать дальше >","В стельку пьяный ПляттВ спектакле «Милый лжец» партнёршей артиста была Любовь Орлова. Актриса относилась к работе очень серьёзно и не любила театральные шутки и розыгрыши.Однажды Орлова зашла к Плятту за час до начала спектакля — ей хотелось повторить сценку. Но в гримёрке её ждал не… читать дальше >","Из школьного сочинения:\"Раскольников убил старуху-процентщицу за то, что она не давала кэшбэк.\"","Хозяйке на заметку.Хороший кусок мяса и стаканчик виски делают женщину моложе, увеличивают грудь и удлиняют ноги.","Ошибки молодости иногда плохи только тем, что их нельзя повторить в старости.","Уважаемый Василий Петрович - зарплата 500 000 р…Василий Петрович – заплата 200 000 рВасилий – зарплата 100 000 рВася – заплата 20 000 рВаська – зарплата 12130 рВасек - безработный","Если пронумеровать четыре запрещенных Роскомнадзором слова, то 1 его знает, может и прокатит?","Зашёл за кофе во французскую булочную. А музыка тут как в армянской. Может это потому, что булочная в Перово, а не в Париже.","Друг рассказывал.В 1988 году меня приняли в пионеры. Всю школу поделили на отряды в Ленинской комнате и каждый отряд должен был быть имени кого-нибудь. Олега Кошевого, Зою Космодемьянскую и прочих расхватали в первую минуту. Нашему отряду остался только Павлик Морозов. Я сказал чтобы все шли в жопу… читать дальше >","Детство в интернете: пишешь всё, о чём думаешь.Взросление в интернете: чаще, написав, нажимаешь \"отменить\", чем \"отправить\"Мудрость в интернете: вместо того, чтобы писать, думаешь.","В Советском Союзе говорили: «Курица не птица, Болгария не заграница». Подбадривая жену в родильном доме, случайно обогатил поговорку: «Роддом не больница».","Зашёл в туалет в Маке. Кабинка занята, стою, жду. Заходит парень с таксой на руках, идёт к писсуару, таксу ставит рядом. Та сначала просто стоит, потом отбегает к входной двери. Парень просит: \"подержи его\". Ну ок, погладил пёселя, вернул владельцу, тот ушел. Открывается кабинка, оттуда выходит мужик и очень подозрительно на меня смотрит. Я только потом понял, почему. Неловко.","- Как быстрее всего прекратить спор глухих?- Выключить свет.","— Чем занимаешься?— Да так, ничем, пытаюсь контролировать свою агрессию, тварь ты ебаная.","Нормальное государство не борется с нищими, оно борется с нищетой.","Bласти французской коммуны Грэль, расположенной в Луаре, запретили умирать в выходные.---По словам мэра Изабель Дюжле (Isabelle Dugelet) «За провокационным указом, запрещающим умирать дома в выходные и праздничные дни, кроется огромная беда многих жителей из-за ситуации со здравоохранением», —… читать дальше >","Верх карьеры - это, когда за своим базаром уже можно не следить.","Начальник - это профессионал, который может всегда посоветовать, как сделать лучше, а не дебил, который хочет, чтобы всегда все было так, как требует он.","Борьба с работающими пенсионерами доказывает, что пенсионная реформа проводится не для увеличения количества работающих.","Перешел с длинных сигарет на короткие, но не накуриваюсь, неужели у баб так же и с членами?","Шахерезада сказала: - Повышая градус, ты понижаешь уровень социальной ответственности.","Самый тонкий и самый убедительный намёк - это бумажка с водяными знаками.","Белые тапочки - последние пуанты балерин...","С нетерпением жду, когда теорию большого взрыва переименуют в теорию большого хлопка....","Слишком затянувшийся отдых - это когда начинаешь уставать от отдыха. И приходится отдыхать с удвоенным усердием.","В наше время рафинированным интеллигентом может считаться человек, у которого матом изъясняется только внутренний голос.","Бывает, что из семени, которое втаптывают в грязь современники, вырастает дерево, которым восхищаются потомки.","Когда ума не хватает, его энтузиазмом подменяют.","Когда люди вырастают, их сердце умирает.","Дорогой подарок не радует того, кто привык отдариваться.","Россия,щедрая душа!Россия щедрая душа,Мы всем долги простим в натуре,Скрипим мы сами,чуть дыша,А что в кремле?там всё в ажуре.Мы Сирии, Ираку, Кубе,Ещё в займы дадим деньжат,В себя вселенную мы влюбим,Вот марсиане к нам спешат.Спешат Китайцы и Монголы,Свой прищюр пуча на заём,На всей земле кризис тяжёлый,А что в России? Всё путём!Ну а уж африканским братьям,Нам не списать долгов то грех,Россия пышет благодатью,Не зря живём мы,\"лучше\" всех!P.S.Вражина шепчет ядовито,Что наш  бюджет,одна дыра,У нас в стране всё шито крыто!Ура товарищи!Ура!","Вчера перебегал, послав медицину нах.Сегодня пластаюсь - ноет заштопанный пах.Недельку другую. пожалуй,ещё отлежусь...А дальше - в седло и от лет придавивших сорвусь.","ЕЩЕ  НЕ  ПРИЕХАЛИ…\rКуда мы едем, \rДоктора спросил?\rЯзык мой, \rИз последних сил.\r- В морг, дорогой, \rТаков судьбы расчет.\rТак я ж не умер… \rНо мы и не приехали еще…","ЧЕМ  ЧЕРТИ  ПРОВИНИЛИСЬ?\rКричит жена, тебе б \rСгореть в аду\rНа вертеле, иль \rНа сковороду!\r- Меня к чертям? \rСкажи на милость,\rА черти то, \rВ чем провинились?...","ПРО  СОЮЗНОЕ  ГОСУДАРСТВО.\r ( про секс в РБ и РФ)\rСЕКС  В  СССР и  В  СИНЕОКОЙ.\rТогда, мы даже, \rНе подозревали,\rЧто есть офшоры, \rОстров БАЛИ.\rВ Союзе секс \rОтсутствовал совсем.\rОб этом чуде – \rГоворили всем.\rА в Синеокой, - \rЧтоб вы знали,\rЗа 30 лет – \rВсё  ПРОЕОстров...\rСЕКС  В СССР  и  В  РОССИИ.\rВ СССР, секс \rВ дефиците был.\rНадеялись  – Россию \rСекс спасет.\rИ вот он, миг \rСчастливый наступил,\rЗа 30 лет там – \rПРОЕОстров  всё…\r30 лет, два разных государства, две судьбы,\rа результат, один – ПРОЕОстров."]