[
	"Аркаша прорыбачил целый день... и ничего не поймал.По пути домой зашел до рыбного магазина купить пару карпиков.Продавец:- Аркаша, мне тут звонила ваша супруга и сказала, шо сегодня вы поймали форель.",
	"В школу я начала ходить ещё в \"проклятое советское время\". В нашем первом \"Б\" было 42 человека, и у учительницы как-то хватало терпения и авторитета держать нас всех в узде. Тогда было принято, что в классе уборку (мытьё доски и полов) делают сами дети - по графику дежурств, попарно. Не помню, чтобы… читать дальше >",
	"Давеча смотрю новости по НТВ. Первый сюжет о том, как бригада российских врачей ездит по городам и весям Сирии, оказывая безвозмездную  медицинскую помощь страждущим сирийцам. Молодцы наши врачи, ничего не скажешь!  Сразу после этого идет сюжет о   несчастном российском  ребенке  у родителей  которого нет денег на операцию, которая ему жизненно необходима. Скинемся всем миром по SMS !  Да, умом Россию не понять…",
	"Бесснежная, теплая зима поломала все планы коммунальщикам. Ремонт дорог отложен до лучших времен...",
	"Если хотите выебнуться за новогодним столом, то: проволока, которая удерживает пробку шампанского называется мюзле и имеет длину 52 см.",
	"Из-за отсутствия нужного специалиста долгое время пришлось ходить в платную клинику. И до меня дошло. Бесплатный врач лечит лучше. Он действительно хочет, чтобы пациент выздоровел! И перестал уже таскаться к нему на прием!",
	"Итоги года: дёргается глаз",
	"Люблю \"гулять\" по гугл мэп и заметил, чем беднее страна - тем больше мусора. Бедность определяет менталитет? Наверное. Возможно людям, которые выживают, а не живут, им некогда думать о чистоте, экологии. Не знаю, но есть причины.Начниссебя это глупости, нужно искать причины, и работать над… читать дальше >",
	"«Бросил [стаканчик] — ничего. Потом пластиковую бутылку — опять ничего. Потом уже бросит и стеклянную бутылку, а потом и камень. Потом стрелять начнут и грабить магазины» (цитата по эфиру RT).Так Владимир Путин ответил вчера на слова главы СПЧ Валерия Фадеева о недопустимости наказывать тюремными… читать дальше >",
	"Сатана: - Добро пожаловать в ад! Твоя жалкая жизнь подошла к концу!Я: - Кто бы говорил. Взрослый мужик, до сих пор живущий в подвале дома своего отца.Сатана (плачет): - Пошли в котёл, говнюк.",
	"Поехали родители на море на две недели. На четвертый день исправных звонков перестали выходить на связь. Провела целую работу по вычислению их базы отдыха и номера путевки по распределению (сутки не спала). Начиная от местного военторга, заканчивая каким-то военкоматом в курортном городе; администратор на ресепшене караулила их и оставляла записки. Родителей нашла, они просто забыли пополнить счет и не могли найти банкомат. Зато теперь понимаю маму, когда я гуляла ночью и трубку не брала.",
	"Казино.Веселые 90-е. Под утро в казино. Пьяненькая дамочка грустная направляется на выход. Видно, что вдрызг проигралась. Роется в сумочке, ищет зеркальце. Находит закатившуюся в недрах сумочки фишку 25$. Подходит к столу на рулетку. Дрожащей рукой ставит на число 13. Выпадает 13. Сгребает выигрыш. Фишка остаётся на 13. Крутится рулетка. Снова выпадает 13.  Немногочисленные зрители застыли в ступоре. Скачет шарик. И вновь 13. Дама как ни в чем ни бывало высыпала все фишки в сумочку и поплелась в кассу.Занавес.",
	"Военный билет - это единственный билет, который ты покупаешь, чтобы никуда не идти.",
	"- Как вы по вкусу пальца определяете направление ветра?",
	"Подумалось: наверное главную ёлку страны сможет опрокинуть только главный кот страны.",
	"Я: - Ну и сколько мне теперь не есть?Стоматолог: - Хотя бы во время приема.",
	"Врач: - Почему вы всем говорите, что вы Наполеон, а мне говорите, что вы Иван Грозный? - Потому, доктор, что я никогда не позволил бы себе вас обманывать.",
	"Замужество - это когда муж женщины защищает всех от нее.",
	"Однажды во вьетнамском городке Вунгтау, когда вечером в гостиничном номере я скинул у кровати тапочки и собрался лечь, у самых ног вдруг появился огромный таракан. Я не промахнулся и удовлетворённый лёг спать.Видимо, вьетнамскому богу это не понравилось, и утром, когда я выходил из ванной, он… читать дальше >",
	"Снял на днях свою зарплату в банкомате. На чеке прочёл:\"Выдача наличных денег НДС не облагается...\"Вот спасибо-то нашему благодетелю-правительству за такую невиданную щедрость! А то ведь могли бы и обложить, и прощай тогда ещё 18% от зарплаты.",
	"По аналогии с \"вашим сиятельством\" и \"вашим величеством\", предлагаю ввести обращение к деятелям от партии едроссов - \"ваше едрочество\"",
	"Поначалу я рассердился, прочитав про решение WADA. А когда эмоции поутихли вспомнил вот такую историю.Одну российскую компаний где-то, в чём-то обвинили и на время расследования опечатали их офис. Эти умники сломали печать-пломбу и что-то из своего офиса вытащили, чтобы помешать следствию. И заявили, что \"печать могла быть старой и сломаться от вибрации\". На что им ответили \"не считай всех такими уж идиотами\".Россия попалась на допинге. Спортсмены виноваты, или чиновники -  не важно. Но по русской привычке все подумали - помухлюем, подтасуем. Вдруг прокатит. Не прокатило.Чего теперь ныть?",
	"Быстрее, выше, сильнее. Именно так на фоне меня выглядят другие парни.",
	"История от 4.12.2016У моей знакомой мама работала то ли в КБ, то ли в НИИ, не помню. У неё был начальник, у того тоже был начальник, и так далее. Фамилии их были такие (перечисляю по мере возрастания должностей): Кац, Крац, Кранц и Розенкранц.Перечитав её в лучших за тот же день, поделился с друзьями. Однокурсница прислала свою версию:— А у нас в театре сейчас работают Окель, Попель и Шокель. Чудесные девушки, актрисы.Закон парных случаев никто отменить не в силах.",
	"- Доктор, что мне принимать от депрессии?- Просто принимайте себя три раза в день после еды.- Себя надо подготовить?- Нет, принимайте как есть.",
	"в этот день 14 лет назад в разделе анекдоты10.12.20052020 год. После окончательного развала ЕС Латвия требует компенсации занезаконное присоединение к Евросоюзу, вывода войск НАТО и немедленнойдепортации трех миллионов турок.Yuriнадо ставить клеймо \"прорицание на гг.мм.дд\"",
	"Подобная тема часто поднимается в анекдотах. Но не всегда это анекдот.У соседки дочь с зятем и детьми уехали отдыхать и попросили ее присматривать за квартирой. Когда приехали, все тефлоновые сковородки блестели, как новенькие.",
	"Все звонящие абоненты из моей телефонной книги в сотовом делятся на «ну наконец-то» и «опять, твою мать…».",
	"Активнее всех иностранных шпионов ищут местные коррупционеры.",
	"В платном туалете:- Мужчина, пакет брать будете?- А что, можно навынос?",
	"Трудно выбрать из двух зол, если они ничем не отличаются.",
	"Искренность чувств не знает ссор.",
	"«Встанет»-такое неоднозначное слово.Если завод встанет-регресс,если член встанет-прогресс.",
	"Кто говорит красиво, как правило, приукрашивает.",
	"Раньше и не задумывались о чем сегодня страшно подумать!",
	"Танки очень здорово смотрятся на параде, но не для этого их делали.",
	"Глобальное потепление.Тают льды. Горячим стало море,От жары расплавился тюлень,Всё живое ищет-рыщет тень,Олигархи (те, кому не лень)В Магадане строят санаторий...",
	"Относительность доброты.На улице, с протянутой рукой,Сидел калека. Как доска - худой.И часто здесь студент один бывал,По сто рублей калеке он давал.А в этот раз, он глубоко вздохнулИ лишь одну десятку протянул.Тут между ними диалог возник:- Прошу прощения! Но я не вник.Вы раньше мне давали сто рублей.Сегодня - десять... Были Вы добрей...- Женюсь я скоро. Вы должны понять -Жене придётся много покупать.- Смотрите-ка - он женится! Ну-ну.А я что должен?! Содержать жену?14.12.2019.genar-58.",
	"БОЯЗНЬ  НЕИЗВЕСТНОСТИ.\rТы должен быть, казнен, \rХолопу царь сказал\rИ на веревку \rСтрого указал.\rНо можешь сам \rСудьбу свою решить:\rВеревка, либо дверь, \rТу, страшную открыть.\r… Когда веревкой \rЗатянули  шею,\rМой царь! \rСпросить тебя я смею.\rВопрос единственный, \rПростой,\rА, что за дверью \rСтрашной той?\r    ***\r- Свобода там, \rНе всем она к лицу,\rОт страха \rВыбирают – ВИСЕЛИЦУ!",
	"Попытался разогнать скуку зевками. Выяснилось, что скука от зевков разгоняется до весьма приличной скорости.",
	"Соседи это что-то.Выхожу утром из квартиры во двор, а на встречу идёт бабушка Ира.Я ей-Доброе утро!Она мне-Хуютро..и прошла мимо.Давление, видимо.",
	"Когда уже все надежды рухнули, Апокалипсис уже не беда.",
	"Единицы, поднимающие на революции миллионы, часто оказываются полными нулями.",
	"Водки море – белой горячки океан.",
	"Когда никак не заснуть, мужчины считают баранов. А женщины - козлов.",
	"ЧТО НОВОГО  С  ФИГУРОЙ.\rНу, как дела? \rСоседку я спросил.\r- Да ж@па,  \rПолная, совсем!\rТы не кричи \rОб этом всем,\rНо сам \rГлаза туда скосил…",
	"Сначала  жизнь  фурор,-  А  в  старости  топор!"
]