["В Финляндии первый снег!!! 8:00 Я слeпил снeговика.8:10 Мoя сосeдка-фeминистка спроcила, почeму я нe слeпил снeжную бaбу.8:15 Тaк что я слeпил eще и снeжную бaбу.8:17 Мoя сосeдка-фeминистка поcмотрела на зaманчивую грудь снeжной бaбы и стaла жaловаться, что снeжных бaб повсeместно… читать дальше >","Для чего собаке пятая ногаЧестно говоря не знаю, зачем я купил эту ногу. Какая-то дьявольская манипуляция. Зашел на мясной рынок взять кой-чего по мелочи, и тут на глаза возьми и попадись эта нога.Наверное сработали какие-то забытые воспоминания из деревенского детства. Непередаваемый дух по… читать дальше >","Без Баскова, Билана, Киркорова - \"Голубой огонёк\" какой-то даже совсем не голубой.","Примерно 80 млн. лет назад, на рубеже мезозоя и кайнозоя, Земля переживала глобальное потепление. Температура воды в Северном Ледовитом океане составляла: зимой 14С, летом 25С, на территории современной Якутии росли: озерная лилия, роза, эвкалипт, в Грен­ландии — каштан, виноградная лоза, гинкго,… читать дальше >","Недавно пересекаю границу США и Канады в Буффало. Даю пасспорт. Пограничник спрашивает: \"Это чей пасспорт?\"Отвечаю: \"Мой.\"Оказалось, что по ошибке взял пасспорт мамы. Думаю, всё, или сразу развернут, или пару часов прошманают и потом развернут.А он спросил: \"Ты в этом году границу пересекал?\"\"Да.\"Попросил показать водительские права, проверил по компъютеру и пропустил.На обратном пути канадские погранцы спросили: \"Сколько времени тебя продержали американцы?\"Я сказал: \"2 минуты\".Они офигели и сказали: \"Ну тогда и мы не будем задерживать!\"","ТИХИЕ ПЕДИКИВ самом конце ноября, где-то на окраине Москвы, в старой пятиэтажке, сняли на месяц квартиру двое мужчин. Один - высокий, лысый, славянской наружности, другой – кавказец с небольшой бородой, но без усов, ниже среднего роста, крепкий, широкоплечий, по виду борец. Бабушкам с этажа сразу… читать дальше >","Со слов друга.Я люблю играться и возюкаться с детками. Со стороны наверное выглядит смешно и нелепо, как большой  толстый бородатый мужик играет с малышнёй в \"море волнуется... ...фигура замри\" или в догонялки. Но и мне и малышне пофиг ;)Когда моя дочка была маленькой, если мне удавалось поймать… читать дальше >","В Госдуме предложили сравнять зарплату депутатов со средней по России...Хотелось бы наоборот!!!","- Мужчина, Вы покупаете ёлку или нет?!  Что Вы её щупаете?- А есть такая же, но с мягкими иголками?- Вы боитесь что дети уколются?- Дети уже выросли. Я хочу  угодить коту.","На мальчишнике у Василия из праздничного торта вылезла \"Упаковщица №15\".","Заходит ко мне на работу молодой человек и говорит: \"купите мужу, парню, папе кошелек\", а я ему говорю \"у меня нет ни мужа, ни парня, ни папы\".Он стоит смотрит на меня грустными глазами, достает конфету, кладет на стол и уходит...Сижу опечаленная на весь день...","- Торговый представитель нашей компании должен хорошо знать свой товар. Что вы знаете про трансформаторное масло?Блондинка с умным видом отвечает:- Трансформаторное масло - это продукт первого отжима трансформаторов…","Знакомая девушка рассказала. Дальше с её слов. Сижу, значит, в Ленинке, читаю книжку. Тут подошёл парень, клеиться начал. Мол, привет, как тебя зовут, как дела, где живёшь. Да зовут Викой, говорю, а живу в Подмосковье. А он в ответ - \"класс, я тоже в Подмосковье живу, домой вместе поедем!\"","На пресс-конференции Путина.- Женщина, вы куда?- Мне только спросить.©","Сегодня с утра, перед работой, решил тортик  прикупить, чтобы потом в очереди не стоять. Бежим с ним мимо городской площади бодренько так в -30, вижу зеленый вагончик, и вспомнилось. Городок у нас не большой, и площадь ему под стать – не большая.  Тем не менее и елка праздничная на месте и горка, и… читать дальше >","Как вышло так, что у всех моих друзей дети уже в школу пошли? Я пропустил какую-то крутую оргию восемь лет назад?!","Удивительная стабильность у нас тут в Москве: летом +10°С, зимой тоже +10°С.","Козёл, обезьяна, змея, бык, петух, собака, свинья, крыса... Видимо, ещё тысячи лет назад китайцы, наблюдая за своими политиками, понимали, что в их человеческом облике никогда ничего не изменится, и запечатлели их психологические портреты в гороскопе...","Главный половой орган женщины - веник.","Юмор - это лейкопластырь, который не лечит, конечно, но помогает перенести боль...© Вуди Аллен","Все ищут хату на Новый Год, а ты не ищешь, ты нашёл — ты с родителями.","Когда у меня проблемы я начинаю петь и понимаю, что мой голос намного хуже моих проблем.","Старость.От  выглядит  обалденно  до  выглядит  обалдело...","Каждому гарантируется свобода мысли, но не её наличие.","ДождюрочкаВ этот раз на Новый годДед Мороз ко всем придётС Мэри Поппинс – ведь у МэриЗонтик есть по крайней мере…","И вдруг исполнится однажды Всё то, о чём и не мечтал… ©","Ты поставь мне красотка на стол,Пару литров, и рюмку левее,Это древний российский прикол,Станешь ты еще красивее!","Трудоголик - это человек, который на досуге любит помечтать о шикарной тяжёлой работе.","К Новому году решил навести порядок в своих дела. Но таковых не казалось. Пришлось наводить порядок в безделье.","У хорошего гитариста стертых на репетициях медиаторов больше."]