<style type="text/css" media="screen">
	.scriptSettings { clear:both;}
	.scriptSettings td { border:1px solid; padding: 10px;}
	.scriptSettings td.bold, .api {width:40%; min-width: 190px; white-space:pre-wrap; word-break: break-all; font: bold 120% monospace; border:1px solid}
	.rem {width:60%; min-width: 185px; }
	@media (max-width: 500px) {
		.rem {word-break: break-all;}
	}
</style>
<h2>Мануал по API скрипта. Версия PRO-2</h2>
<div style="padding: 20px;">

	<p>Скрипт <strong>Версия сайта для слабовидящих PRO-2</strong> работает после установки мной его на ваш сайт "прямо из коробки", используя настройки, заданные в нем по умолчанию. Но он обладает достаточной гибкостью в дополнительных настройках, которые были предусмотрены изначально, и позволяет, при необходимости, изменять как внешний вид и положение кнопки, так и изображения в панели управления.</p>
	<p>В начале написания скрипта я сразу задался проблемой ограничения области видимости его переменных. От стандартного ее решения - оборачивания кода внешней функцией, я отказался намеренно, поскольку такой способ исключает возможность изменения внутренних параметров извне скрипта. В итоге, я остановился на создании единственного глобального объекта, назвав его <em>DizSel</em>. Теперь мы можем спокойно получать доступ к его свойствам и методам, не засоряя при этом глобальную область видимости переменных.</p>
	<p>Для того, чтобы пользователи моего скрипта смогли самостоятельно пользоваться этими настройками, я и решил создать данный мануал.</p>
	<blockquote><p>На всякий случай напоминаю, что все скриптовые настройки должны находиться в блоке между тегами &lt;script type="text/javascript"&gt; и &lt;/script&gt;. Сам блок лучше размещать в нижней части сайта (футере). Иначе сайт может перестать корректно работать, а в отладочной консоли появится запись, что DizSel не определен. При такой ситуации блок с настройками нужно разместить еще "ниже" в общей верстке страницы, то есть - ближе к тегу <b>&lt;/html&gt;</b> </p>
	</blockquote>

	<h3>Настройка кнопки вызова скрипта</h3>
	<h4>Использование своего изображения вместо стандартной кнопки</h4>
		<div class="alignleft api" >DizSel.addImg ("адрес изображения", "стили CSS для изображения")</div>
		<div class="alignright rem">Кнопка по умолчанию поменяется на изображение. Например, это может выглядеть так: <b>DizSel.addImg("/on.jpg", "width:100px;cursor:pointer;border:1px solid #117;padding:0")</b></div>
		<div class="clear"></div>

	<h4>Переопределение положения кнопки</h4>
	<p>Теперь ответ на один из самых частых вопросов: можно ли разместить кнопку в другом месте? Да, можно, и это легко. По умолчанию кнопка стоит в верхнем левом углу экрана, но, если нужно ее переместить в конкретный блок сайта, достаточно выполнить следующие действия:</p>
		<div class="alignleft api" >&lt;div id="<span class="red">but</span>"&gt; Тут может быть и другое содержимое &lt;/div&gt;</div>
		<div class="alignright rem">Создать блочный элемент внутри тела html-разметки (между тегами &lt;body&gt; и &lt;/body&gt;) с назначенным идентификатором, либо назначить идентификатор существующему блоку</div>
		<div class="clear"></div>
		<div class="alignleft api" >DizSel.SlabovidButtonParent= _K.G('#<span class="red">but</span>');</div>
		<div class="alignright rem">Указать в настройках скрипта идентификатор нужного блока в приведенном формате. В результате кнопка переместится в указанный блок, став его первым потомком. Работает после выполнения предыдущих инструкций.</div>
		<div class="clear"></div>

	<h4>Изменение/добавление стилей кнопки</h4>
		<div class="alignleft api" >_K.G(DizSel.SlabovidButton, {position:'fixed', top:'5px', right:'5px'});</div>
		<div class="alignright rem">Изменение стилей кнопки вызова скрипта. В данном примере - фиксирование ее положения на странице, игнорируя вертикальную прокрутку.</div>
		<div class="clear"></div>
		<div class="alignleft api" >_K.G(DizSel.SlabovidButton, { backgroundColor:'transparent', border:'none' });</div>
		<div class="alignright rem">В этом примере убираем фон и рамку кнопки, оставляя только текст и изображение. Вообще данным приемом можно менять любые стили кнопки, полностью преображая ее.</div>
		<div class="clear"></div>
		<div class="alignleft api" >DizSel.sts.button.image= 'blind.png';</div>
		<div class="alignright rem">Смена изображения на кнопке с глаза на очки <img class="none" src="/css/Slabovid_PRO/blind.png" style="margin:0 7px;" alt="Для слабовидящих" /></div>
		<div class="clear"></div>

	<h3>Настройка Панели Управления (ПУ) скриптом</h3>
	<h4>Изменение положения ПУ</h4>
		<p>Если по каким-то соображениям вам будет необходимо перенести ПУ вниз области экрана, это легко сделать следующим образом.</p>
			<div class="alignleft api" >_K.DR(function() {_K.G('$div#special-panel', {top:'unset', bottom:0}) });</div>
			<div class="alignright rem">Отменяем привязку ПУ к верху сайта (положение по умолчанию) и перемещаем вниз области видимости сайта. Позиция ее остается по-прежнему фиксированной при вертикальной прокрутке страницы.</div>
			<div class="clear"></div>
	<h4>Изменение изображений в ПУ</h4>
		<p>Начали поступать вопросы по адаптации изображений в ПУ к дизайну конкретного сайта. Поскольку угодить всем я не могу, да и вряд ли кто-то сможет, поэтому ниже приведена инструкция по скачиванию папки с изображениями и файлами CSS и заменой их по необходимости на свои.</p>
		<ul>
			Итак, последовательность действий:
			<li>Скачать как ZIP-файл по <a href="/PHP/dl_save.php?filename=css/Slabovid_PRO/" target="_blank">ссылке</a></li>
			<li>Распаковать каталог Slabovid_PRO и заменить в нем желаемые изображения на свои. Формат (расширение) файлов сохранять!</li>
			<li>Залить каталог Slabovid_PRO в корень своего сайта</li>
			<li>Внести скриптовую настройку в футере сайта: <strong>DizSel.urlBG= "/Slabovid_PRO/";</strong></li>
			<li>Все, теперь все изображения ПУ грузятся с вашего сайта и Вы их можете менять по собственному усмотрению, соблюдая вышеизложенные правила.
				<p class="warning">Будьте осторожны! Теперь все настройки стилей также будут грузиться с Вашего хостинга. Если по неосторожности удалить один из файлов в каталоге Slabovid_PRO - работоспособность всего скрипта может быть нарушена.</p>
			</li>
		</ul>

	<h4>Уменьшение/увеличение размера шрифта <img class="none" src="/css/Slabovid_PRO/fontBig.png" alt="Уменьшить шрифт" style="width:30px; margin:0 7px;" /><img class="none" src="/css/Slabovid_PRO/fontBig.png" alt="Увеличить шрифт" style="margin:0 7px;" /></h4>
		<p>Вариантов изменения размера шрифта предусмотрено два: фиксированный размер при нажатию на каждую из пиктограмм и итерационный, изменяющий размер постепенно до max/min значения. В настройках по умолчанию установлен 2-й вариант, но это можно изменить следующим кодом: </p>
			<div class="alignleft api" >DizSel.sts.fontSize.step= 3;</div>
			<div class="alignright rem">Шаг изменения размера шрифта при итерационном изменении</div>
			<div class="clear"></div>
			<div class="alignleft api" >DizSel.sts.fontSize.iter= 3;</div>
			<div class="alignright rem">Количество шагов изменения размера шрифта при итерационном изменении. То есть шрифт изменится на 3рх не более 3 раз как в сторону увеличения, так и в сторону уменьшения. На мой взгляд это является оптимальной настройкой.</div>
			<div class="clear"></div>
			<div class="alignleft api" >DizSel.sts.fontSize.fixed= true;</div>
			<div class="alignright rem">Фиксируем размер шрифта в фиксированный формат min/max. При true - предыдущая настройка (<b>DizSel.sts.fontSize.step</b>) перестает работать, поскольку при первом же нажатии на кнопку Увеличить/Уменьшить размер шрифта сразу же примет значение, указанное в настройке <b>DizSel.sts.fontSize.min/DizSel.sts.fontSize.max</b> (см. ниже). При false - итерационное изменение (по умолчанию).<br /></div>
<div class="clear"></div>
			<div>
				Стоит уточнить, что при фиксированном изменении размер шрифта будет увеличен/уменьшин на величину <b>DizSel.sts.fontSize.step * DizSel.sts.fontSize.iter</b> относительно своего первоначального размера. То есть, при дефолтных настройках величина шрифта при увеличении / уменьшении изменится на +9/-9 рх соответственно.
			</div>

	<h4>Показ изображений <img class="none" src="/css/Slabovid_PRO/imageOff.gif" style="margin:0 7px;" alt="Показ изображений" /></h4>
		<div class="alignleft api" >DizSel.sts.imageOff.minImg= 70;</div>
		<div class="alignright rem">Изменение минимальной ширины изображений, с которыми работает модуль <b>Показ изображений</b>.</div>
		<div class="clear"></div>

</div>
